app/views/homepage/_completed_projects.html.erb

<% Project.where(completed: true).each do |project| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."completed" = ?  [["completed", 1]]