app/views/homepage/_current_projects.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."completed" = ?  [["completed", 0]]
---
<% Project.where(completed: false).each do |project| %>