app/views/homepage/_project_row.html.erb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."project_id" = ?  [["project_id", 3]]
---

            <% project.pictures.each do |next_picture| %>

SELECT "links".* FROM "links" WHERE "links"."project_id" = ?  [["project_id", 5]]
---
              |
               <% project.links.each do |next_link| %>