app/controllers/homepage_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."completed" = ?  [["completed", 0]]
---
  def index
  	@current_projects = Project.where(completed: false)

SELECT "messages".* FROM "messages" WHERE "messages"."senderIp" = ?  [["senderIp", "::1"]]
INSERT INTO "messages" ("senderIp", "senderEmail", "title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["senderIp", "::1"], ["senderEmail", "sfdsdfdsf@yahoo.osd"], ["title", "dsfsdf"], ["message", "sdfdsf"], ["created_at", "2019-05-25 21:39:21.624953"], ["updated_at", "2019-05-25 21:39:21.624953"]]
---
  def send_email

     # Max message sent limit by a client IP
     if ( Message.where(senderIp: params[:clientIp]).length <= 5 )
        new_message = Message.create(
         :senderIp => params[:clientIp].to_s,
         :senderEmail => params[:email],
         :first =>  params[:firstName].count("a-zA-Z") > 0 ? params[:firstName] : nil,
         :last => params[:lastName].count("a-zA-Z") > 0 ? params[:firstName] : nil,
         :title => params[:subjectTitle],
         :message => params[:emailBody],
        )

SELECT "projects".* FROM "projects" WHERE "projects"."completed" = ?  [["completed", 1]]
---
          end

          # REFRACTOR THIS ERROR DISPLAY METHOD
          @current_projects = Project.where(completed: false)